Revit 2027 API
BuiltInFailures.StairRampFailures.CannotAlignSupportOnPosts Property
 Cannot align the support on the posts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAlignSupportOnPosts { get; }
Public Shared ReadOnly Property CannotAlignSupportOnPosts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAlignSupportOnPosts {
	FailureDefinitionId^ get ();
}
static member CannotAlignSupportOnPosts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace